{
	"running_replicas": "Running Replicas",
	"k8sType": "K8s Type",
	"editClusterComponent": "Edit Cluster Component",
	"hpaName": "HPA Name",
	"replicas": "Replica Count",
	"replicasDescription": "Specifies the desired number of identical replicas of a pod that should be created and maintained by the Kubernetes deployment controller. Each replica represents a single instance of the application.",
	"minReplicas": "Min Replicas",
	"minReplicasDescription": "Specifies the minimum number of replicas that should be maintained by the Kubernetes deployment controller.",
	"maxReplicas": "Max Replicas",
	"maxReplicasDescription": "Specifies the maximum number of replicas that should be maintained by the Kubernetes deployment controller.",
	"yourClusterId": "Your Cluster ID",
	"yourClusterIdDescription": "This is your Agnost Cluster id.",
	"clusterVersion": "Cluster Version",
	"transferClusterOwnership": "Transfer Cluster Ownership",
	"transferClusterOwnershipDescription": "Select the cluster member that you would like to transfer the ownership of the cluster.",
	"release_info": "Release Info",
	"history": "Release History",
	"release": "Version",
	"deployedAt": "Deployed At",
	"open_release_history": "Open release history",
	"component": "Component",
	"status": "Status",
	"current": "Current",
	"latest": "Latest",
	"update": "Update to release {{release}}",
	"update_available": "You have updates available for your cluster.",
	"up_to_date": "Your cluster is on the latest release",
	"view_notes": "View release notes",
	"deployed_at": "Deployed at",
	"deploy_success": "Updating cluster release.",
	"custom_domain": "Custom Domain",
	"custom_domain_description": "Custom domain allows you to access your Agnost cluster Studio app from a using a domain name that you manage. Agnost automatically generates a SSL certificate (including the wildcard certificate) for your custom domain and manages the certificate renewal process.",
	"enforce_https": "Enforce HTTPS",
	"enforce_https_description": "HTTPS provides a layer of encryption that prevents others from snooping or tampering with traffic to your cluster components and apps. When HTTPS is enforced, your cluster services and apps will only be served over HTTPS. If enabled, your will not be able to access your cluster through http://ip_number.",
	"enforce_https_success": "Enforce HTTPS has been enabled successfully.",
	"dns_settings": "DNS Settings",
	"dns_settings_description": "If this is the first time your are setting the custom domain of your cluster, please add the following records to the DNS settings of your domain.",
	"ttl": "TTL",
	"domains": "Domains",
	"add_domain": "Set Domain",
	"domains_description": "Enter custom domain yourdomain.com or sub-domain subdomain.yourdomain.com.",
	"domain_added": "Domain added successfully.",
	"delete_domain_success": "Domain deleted successfully.",
	"empty_domain": "You do not have any custom domain for this app version.",
	"domain": {
		"title": "Domain",
		"urlTitle": "URL",
		"delete": "Delete Domain",
		"delete_description": "Are you sure you want to delete this domain?"
	},
	"gitOps": "GitOps",
	"gitOpsDescription": "Automate and manage infrastructure and application deployment. When you activate GitOps you will be able to deploy any app in any programming langugage (as long as the app can be Dockerized) hosted on your Git repository automatically.",
	"gitOpsEnabled": "GitOps Enabled Successfully",
	"gitOpsDisabled": "GitOps Disabled Successfully",
	"activate": "Activate",
	"deactivate": "Deactivate",
	"gitOpsActive": "GitOps is active for this cluster.",
	"gitOpsActiveDescription": "You can  deploy any app in any programming language hosted on your Git repository automatically.",
	"setReverseProxy": "Set Reverse Proxy URL",
	"setReverseProxyDescription": "Set the reverse proxy URL for your cluster.",
	"reverseProxyURL": "Reverse Proxy URL (Optional)",
	"reverseProxyURLDescription": "If you have installed your Agnost cluster locally and have no public acccess, you can use a reverse proxy service like Ngrok to access your cluster. This URL will be used to trigger build & deploy pipelines for your local cluster. If you have not set a custom domain for your cluster, Agnost will use this URL to configure webhooks at Git providers so that repository push event triggers can be handled.",
	"reverseProxyURLSuccess": "Reverse proxy URL has been set successfully.",
	"ip": "Value/IP Address",
	"target": "Value/Target",
	"at": "A",
	"cname": "CNAME",
	"domain_error": "Your cluster is not accessible publicly through a public IP address or DNS hostname. You Agnost cluster needs to be publicly accessible to set a custom domain to issue SSL certificates.",
	"alias": "ALIAS"
}
